eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/inc/em_lesense.h
  /** Select PRS channel input for bit 3 of LESENSE decoder. */
  LESENSE_PRSSel_TypeDef   prsChSel3;
} LESENSE_DecCtrlDesc_TypeDef;

/** Default configuration for LESENSE_PerCtrl_TypeDef structure. */
#define LESENSE_DECCTRL_DESC_DEFAULT                                                         \
  {                                                                                          \
    lesenseDecInputSensorSt, /* SENSORSTATE register is used as input to decoder.         */ \
    0U,                      /* State 0 is the initial state of decoder. */                  \
    false,                   /* Disable check of current state. */                           \
    true,                    /* Enable channel x % 16 interrupt on state x change. */        \
    true,                    /* Enable decoder hysteresis on PRS0 output. */                 \
    true,                    /* Enable decoder hysteresis on PRS1 output. */                 \
    true,                    /* Enable decoder hysteresis on PRS2 output. */                 \
    true,                    /* Enable decoder hysteresis on PRS3 output. */                 \
    false,                   /* Disable count mode on decoder PRS channels 0 and 1*/         \
    lesensePRSCh0,           /* PRS Channel 0 as input for bit 0 of LESENSE decoder. */      \
    lesensePRSCh1,           /* PRS Channel 1 as input for bit 1 of LESENSE decoder. */      \
    lesensePRSCh2,           /* PRS Channel 2 as input for bit 2 of LESENSE decoder. */      \
    lesensePRSCh3,           /* PRS Channel 3 as input for bit 3 of LESENSE decoder. */      \
  }

/** LESENSE module initialization structure. */
typedef struct {
  /** LESENSE core configuration parameters. */
  LESENSE_CoreCtrlDesc_TypeDef coreCtrl;

  /** LESENSE timing configuration parameters. */
  LESENSE_TimeCtrlDesc_TypeDef timeCtrl;

  /** LESENSE peripheral configuration parameters. */
  LESENSE_PerCtrlDesc_TypeDef  perCtrl;

  /** LESENSE decoder configuration parameters. */
  LESENSE_DecCtrlDesc_TypeDef  decCtrl;
} LESENSE_Init_TypeDef;

/** Default configuration for LESENSE_Init_TypeDef structure. */
#define LESENSE_INIT_DEFAULT                                                                \
  {                                                                                         \
    .coreCtrl = LESENSE_CORECTRL_DESC_DEFAULT, /* Default core control parameters. */       \
    .timeCtrl = LESENSE_TIMECTRL_DESC_DEFAULT, /* Default time control parameters. */       \
    .perCtrl  = LESENSE_PERCTRL_DESC_DEFAULT,  /* Default peripheral control parameters. */ \
    .decCtrl  = LESENSE_DECCTRL_DESC_DEFAULT   /* Default decoder control parameters. */    \
  }

/** Channel descriptor structure. */
typedef struct {
  /** Set to enable scan channel CHx. */
  bool                          enaScanCh;

  /** Set to enable CHx pin. */
  bool                          enaPin;

  /** Enable/disable channel interrupts after configuring all the sensor channel
   *  parameters. */
  bool                          enaInt;

  /** Configure channel pin mode for the excitation phase of the scan sequence.
   *  Note: OPAOUT is only available on channels 2, 3, 4, and 5. */
  LESENSE_ChPinExMode_TypeDef   chPinExMode;

  /** Configure channel pin idle setup in LESENSE idle phase. */
  LESENSE_ChPinIdleMode_TypeDef chPinIdleMode;

  /** Set to use alternate excite pin for excitation. */
  bool                          useAltEx;

  /** Set to enable result from this channel being shifted into the decoder
   *  register. */
  bool                          shiftRes;

  /** Set to invert result bit stored in the SCANRES register. */
  bool                          invRes;

  /** Set to store counter value in the RAM (accessible via RESDATA) and make
   *  the comparison result available in the SCANRES register. */
  bool                          storeCntRes;

  /** Select clock used for the excitation timing. */
  LESENSE_ChClk_TypeDef         exClk;

  /** Select clock used for the sample delay timing. */
  LESENSE_ChClk_TypeDef         sampleClk;

  /** Configure the excitation time. Excitation will last exTime+1 excitation clock
   *  cycles. Valid range: 0-63 (6 bits). */
  uint8_t                       exTime;

  /** Configure the sample delay. Sampling will occur after sampleDelay+1 sample
   *  clock cycles. Valid range: 0-127 (7 bits) or 0-255 (8 bits) depending on
   *  device. */
  uint8_t                       sampleDelay;

  /** Configure the measure delay. Sensor measuring is delayed for measDelay
   *  excitation clock cycles. Valid range: 0-127 (7 bits) or 0-1023 (10 bits)
   *  depending on device. */
  uint16_t                       measDelay;

  /** Configure the ACMP threshold or the DAC data.
   *  If perCtrl.dacCh0Data or perCtrl.dacCh1Data is set to #lesenseDACIfData,
   *  acmpThres defines the 12-bit DAC data in the corresponding data register
   *  of DAC interface (DACn_CH0DATA and DACn_CH1DATA).
   *  In this case, the valid range is: 0-4095 (12 bits).
   *  If perCtrl.dacCh0Data or perCtrl.dacCh1Data is set to lesenseACMPThres,
   *  acmpThres defines the 6-bit Vdd scaling factor of ACMP negative input
   *  (VDDLEVEL in ACMP_INPUTSEL register).
   *  In this case, the valid range is: 0-63 (6 bits). */
  uint16_t                     acmpThres;

  /** Select if the ACMP output, the ADC output or the counter output should be used in
   *  comparison. */
  LESENSE_ChSampleMode_TypeDef sampleMode;

  /** Configure the interrupt generation mode for the CHx interrupt flag. */
  LESENSE_ChIntMode_TypeDef    intMode;

  /** Configure the decision threshold for the sensor data comparison.
   *  Valid range: 0-65535 (16 bits). */
  uint16_t                     cntThres;

  /** Select the mode for counter comparison. */
  LESENSE_ChCompMode_TypeDef   compMode;

#if defined(_LESENSE_CH_EVAL_MODE_MASK)
  /** Select the sensor evaluation mode. */
  LESENSE_ChEvalMode_TypeDef   evalMode;
#endif
} LESENSE_ChDesc_TypeDef;

/** Configuration structure for all the scan channels. */
typedef struct {
  /** Channel descriptor for all the LESENSE channels. */
  LESENSE_ChDesc_TypeDef Ch[LESENSE_NUM_CHANNELS];
} LESENSE_ChAll_TypeDef;

/** Default configuration for the scan channel. */
#if defined(_LESENSE_CH_EVAL_MODE_MASK)
#define LESENSE_CH_CONF_DEFAULT                                                                         \
  {                                                                                                     \
    false,                   /* Disable scan channel. */                                                \
    false,                   /* Disable assigned pin on scan channel. */                                \
    false,                   /* Disable interrupts on channel. */                                       \
    lesenseChPinExDis,       /* Channel pin is disabled during excitation period. */                    \
    lesenseChPinIdleDis,     /* Channel pin is disabled during idle period. */                          \
    false,                   /* Do not use alternate excitation pins for excitation. */                 \
    false,                   /* Disabled to shift results from this channel to decoder register.     */ \
    false,                   /* Disabled to invert scan result bit. */                                  \
    false,                   /* Disabled to store counter value in result buffer. */                    \
    lesenseClkLF,            /* Use LF clock for excitation timing. */                                  \
    lesenseClkLF,            /* Use LF clock for sample timing. */                                      \
    0x00U,                   /* Excitation time is set to 0(+1) excitation clock cycles. */             \
    0x00U,                   /* Sample delay is set to 0(+1) sample clock cycles. */                    \
    0x00U,                   /* Measure delay is set to 0 excitation clock cycles.*/                    \
    0x00U,                   /* ACMP threshold has been set to 0. */                                    \
    lesenseSampleModeACMP,   /* ACMP output will be used in comparison. */                              \
    lesenseSetIntNone,       /* No interrupt is generated by the channel. */                            \
    0x00U,                   /* Counter threshold has bee set to 0x00. */                               \
    lesenseCompModeLess,     /* Compare mode has been set to trigger interrupt on "less". */            \
    lesenseEvalModeThreshold /* Evaluation mode has been set to trigger interrupt on threshold. */      \
  }
#else
#define LESENSE_CH_CONF_DEFAULT                                                                         \
  {                                                                                                     \
    false,                   /* Disable scan channel. */                                                \
    false,                   /* Disable assigned pin on scan channel. */                                \
    false,                   /* Disable interrupts on channel. */                                       \
    lesenseChPinExDis,       /* Channel pin is disabled during excitation period. */                    \
    lesenseChPinIdleDis,     /* Channel pin is disabled during idle period. */                          \
    false,                   /* Do not use alternate excitation pins for excitation. */                 \
    false,                   /* Disabled to shift results from this channel to decoder register.     */ \
    false,                   /* Disabled to invert scan result bit. */                                  \
    false,                   /* Disabled to store counter value in result buffer. */                    \
    lesenseClkLF,            /* Use LF clock for excitation timing. */                                  \
    lesenseClkLF,            /* Use LF clock for sample timing. */                                      \
    0x00U,                   /* Excitation time is set to 0(+1) excitation clock cycles. */             \
    0x00U,                   /* Sample delay is set to 0(+1) sample clock cycles. */                    \
    0x00U,                   /* Measure delay is set to 0 excitation clock cycles.*/                    \
    0x00U,                   /* ACMP threshold has been set to 0. */                                    \
    lesenseSampleModeACMP,   /* ACMP output will be used in comparison. */                              \
    lesenseSetIntNone,       /* No interrupt is generated by the channel. */                            \
    0x00U,                   /* Counter threshold has bee set to 0x00. */                               \
    lesenseCompModeLess      /* Compare mode has been set to trigger interrupt on "less". */            \
  }
#endif

/** Default configuration for all the sensor channels. */
#define LESENSE_SCAN_CONF_DEFAULT                     \
  {                                                   \
    {                                                 \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 0. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 1. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 2. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 3. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 4. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 5. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 6. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 7. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 8. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 9. */  \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 10. */ \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 11. */ \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 12. */ \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 13. */ \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 14. */ \
      LESENSE_CH_CONF_DEFAULT, /* Scan channel 15. */ \
    }                                                 \
  }

